app/views/books/index.html.erb

  <%= field_set_tag 'Author' do %>
    <%= select_tag :author, options_from_collection_for_select(Book.group(:author), "author", "author", :selected => params[:author]), :include_blank => true, class: "form-control" %>
---
SELECT "books".* FROM "books"  WHERE (author LIKE '%José Valim%') AND (search LIKE '%rails%')