app/controllers/books_controller.rb

  def index
    if params[:search]
      @books = Book.search(params[:search],params[:author], params[:min_price], params[:max_price]).available
---
SELECT "books".* FROM "books"  WHERE (author LIKE '%José Valim%') AND (search LIKE '%rails%')

  def create
    @book = current_user.books.new(book_params)
    @book.save
---
INSERT INTO "books" ("author", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "resource_content_type", "resource_file_name", "resource_file_size", "resource_updated_at", "slug", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)