app/controllers/transactions_controller.rb

SELECT  "books".* FROM "books"  WHERE "books"."slug" = 'magento' LIMIT 1
INSERT INTO "sales" ("amount", "book_id", "buyer_email", "created_at", "guid", "seller_email", "state", "stripe_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
	def create

		book = Book.find_by!(slug: params[:slug])
		sale = book.sales.create(
			amount: book.price,
			buyer_email: current_user.email,
			seller_email: book.user.email,
			stripe_token: params[:stripeToken])
		sale.process!

		if sale.finished?
			redirect_to pickup_url(guid: sale.guid), notice: "Transaction Successful"

			# Send Email to notify the user who place the order as well as the one you got paid!
			# current_user.email - Buyer Email
			# book.user.email - Book Owner Email

			TransactionMailer.order_completed(book.user.email, current_user.email, book).deliver

SELECT  "sales".* FROM "sales"  WHERE "sales"."guid" = '55f97116-5cf7-4622-b2b4-97dc69f40816' LIMIT 1
---
	def pickup
		@sale = Sale.find_by!(guid: params[:guid])